# SteelElemWeldDoubleEffectivethroat Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldDoubleEffectivethroat Property
ParameterTypeId Class See Also
---
"Double Effective Throat"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldDoubleEffectivethroat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldDoubleEffectivethroat As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldDoubleEffectivethroat {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace